In [1]:
import pandas as pd
import numpy as np

In [2]:
df=pd.read_csv("Social_Network_Ads.csv")
df.head()

   Age  EstimatedSalary  Purchased
0   19            19000          0
1   35            20000          0
2   26            43000          0
3   27            57000          0
4   19            76000          0

In [3]:
x=df.drop("Purchased", axis=1)
y=df["Purchased"]

In [7]:
x=pd.DataFrame(data=x)
x.head()

   Age  EstimatedSalary
0   19            19000
1   35            20000
2   26            43000
3   27            57000
4   19            76000

In [8]:
y=pd.DataFrame(data=y)
y.head()

   Purchased
0          0
1          0
2          0
3          0
4          0

In [9]:
x.

TypeError: 'tuple' object is not callable